---
kind: enumMember
id: F:Autodesk.Revit.DB.WallCrossSection.Vertical
enum: Autodesk.Revit.DB.WallCrossSection
source: html/c0017a61-ed27-8124-f3f7-17d73c446169.htm
---
# Autodesk.Revit.DB.WallCrossSection.Vertical

A vertical wall, 0 degrees.